app/views/ratings/index.html.erb

SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", 1]]
---
    <% @ratings.each do |rating| %>
    <% @beers = Beer.find(rating.beer_id) %>