app/views/breweries/show.html.erb

<p>Number of beers:
 <%= @brewery.beers.count %>
---
SELECT "beers".* FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]
SELECT COUNT(*) FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]