app/controllers/ratings_controller.rb

  def create
    rating = Rating.create params.require(:rating).permit(:score, :beer_id)
---
INSERT INTO "ratings" ("score", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score", 10], ["beer_id", 1], ["created_at", "2017-02-03 15:08:16.804952"], ["updated_at", "2017-02-03 15:08:16.804952"]]

  def destroy
    rating = Rating.find(params[:id])
    rating.delete
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT 1  [["id", 15]]
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 15]]